# -*- coding: utf-8 -*-

alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"

text1 = "блюншж явфвн, бйёпнёж яиэбёйёнляёф! оплизкриоь о еэбэфвж, злабэ кэ яштлбв квжнлккэь овпщ блидкэ яшбэяэпщ кв плищзл зиэоо (зиэооёсёзэуёь) ё кв мнлопл фёоил (нванвооёь). кэ яштлбв крдкл ялеянэцэпщ x, y, width, height ё зиэоо люкэнрдвкклал кэ зэнпёкзв лючвзпэ (ёиё зллнбёкэпш плфвз злкпрнля ъплал лючвзпэ, э-иь овайвкпэуёь)."
text2 = "эзъйфг эюжх. зйьщжвбщлзйф дмйкзы ийюэезавев люёф ийзюдлзы из дмйкм ai, зжв ы щллщрю. цлз жюзъшбщлюехжфю люёф, ыф ёзаюлю ыфъйщлх ечъмч кызч."
text3 = "зрмцфмн ёпдзмрмфтёмы, зиса зтефян. ря х ёдрм еихизтёдпм ут очфхч фтхд отедпац. утпстъисстн уфтжфдрря рси сднцм си чздптха, пмьа цтпаот офдцомн упдс очфхд: "
text4 = "зтефян зиса. ёт ёпткисмм сдьи отррифыихоти уфизпткисми ут утотумнстрч техпчкмёдсмв. д цдоки хумхто уфизтхцдёпгирящ сдрм чхпчж. ечзир фдзя здпасиньирч уптзтцётфстрч хтцфчзсмыихцёч!"
text5 = "сьоюьт баюь. обсйат сьоюи этютшцыбай каьа внчщ ын ятюптю. каь сщм ныыи п кщтшаюцшб ьэцяныцт ыьътышщнабюи ынсь хнамыбай."
text6 = "упьлнэюняхюр, пшфюьфх! шрщк уъняю щлюлчзк эрьоррнщл. к кнчкйэз ъафвфлчзщжш ыьрпэюлнфюрчршцьяыщъх ыьъфунъпэюнрщщъчъофэюфгрэцъх цъшылщфф. улщфшлршэк ыъэюлнцлшфыъ йоя ьъээфф."
text7 = "тэпяйш туьк. рэ юуярйд samsung ai юяэрэтчб тън ьо 10сэ ыоабуя щъоаа р ысв. "
text8 = "ощлыёф мпвпы, очуэыуф мцкоучуыщмув! ъщоьхксуэп, хщнок юшкь люопэ ьцпоюидпп ткшйэуп?"
text9 = " ощлыёф опшж. мкг ъщвэщмёф йдух кхэумуыщмкцу"
text10 = " чвфдоэ чшбп, жхуъушаоэ юяьшбё ! х гдвчвяъшбьш булшцв е хуаь чьуявцу- бугдухятс булш гдшчявъшбьш гв гвчюяскшбьс ьбёшдбшёу чят хулшэ вдцубьыуйьь!"

def decrypt(letters, shift):
    rezult=""
    for letter in letters:
        if (letter in alphabet):
            position=alphabet.find(letter)
            position= (position-shift) % len(alphabet)
            rezult=rezult+alphabet[position]
        else:
             rezult=rezult+letter
    return rezult

print("Задание 1: ", decrypt(text1, 30))
print("Задание 2: ", decrypt(text2, 26))
print("Задание 3: ", decrypt(text3, 4))
print("Задание 4: ", decrypt(text4, 4))
print("Задание 5: ", decrypt(text5, 14))
print("Задание 6: ", decrypt(text6, 12))
print("Задание 7: ", decrypt(text7, 15))
print("Задание 8: ", decrypt(text8, 11))
print("Задание 9: ", decrypt(text9, 11))
print("Задание 10: ", decrypt(text10, 20))